# ParameterValueNotInRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..ParameterValueNotInRange Property
BuiltInFailures..::..GeneralFailures Class See Also
---
The value for [Parameter Name] must be between [Value] and [Value].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ParameterValueNotInRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ParameterValueNotInRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ParameterValueNotInRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace